[NoCoverage] BlockStatement
src/App.vue:10:17
 const { chooseWord } = useWords()
 const { resetScore } = useScoreStore()
 
-onMounted(() => {
-  resetScore()
-  chooseWord()
-})
+onMounted(() => {})
 </script>
 
