[NoCoverage] StringLiteral
src/assets/words.js:4:31
 const fs = require('fs')
 const _ = require('lodash')
 
-const words = fs.readFileSync('./all-words.txt', 'utf-8')
+const words = fs.readFileSync("", 'utf-8')
 
 const wordsArray = words

[NoCoverage] MethodExpression
src/assets/words.js:6:20
 
 const words = fs.readFileSync('./all-words.txt', 'utf-8')
 
-const wordsArray = words
-  .split(' ')
-  .filter((w) => w.length <= 6 && w.length >= 3)
+const wordsArray = words.split(' ')
   .map((w) => w.toLowerCase())
 const uniqueWords = _.uniq(wordsArray)

[NoCoverage] StringLiteral
src/assets/words.js:7:10
 const words = fs.readFileSync('./all-words.txt', 'utf-8')
 
 const wordsArray = words
-  .split(' ')
+  .split("")
   .filter((w) => w.length <= 6 && w.length >= 3)
   .map((w) => w.toLowerCase())

[NoCoverage] EqualityOperator
src/assets/words.js:8:18
 
 const wordsArray = words
   .split(' ')
-  .filter((w) => w.length <= 6 && w.length >= 3)
+  .filter((w) => w.length < 6 && w.length >= 3)
   .map((w) => w.toLowerCase())
 const uniqueWords = _.uniq(wordsArray)

[NoCoverage] EqualityOperator
src/assets/words.js:8:35
 
 const wordsArray = words
   .split(' ')
-  .filter((w) => w.length <= 6 && w.length >= 3)
+  .filter((w) => w.length <= 6 && w.length < 3)
   .map((w) => w.toLowerCase())
 const uniqueWords = _.uniq(wordsArray)

[NoCoverage] MethodExpression
src/assets/words.js:9:15
 const wordsArray = words
   .split(' ')
   .filter((w) => w.length <= 6 && w.length >= 3)
-  .map((w) => w.toLowerCase())
+  .map((w) => w.toUpperCase())
 const uniqueWords = _.uniq(wordsArray)
 console.log(uniqueWords.length)

[NoCoverage] ArrowFunction
src/assets/words.js:9:8
 const wordsArray = words
   .split(' ')
   .filter((w) => w.length <= 6 && w.length >= 3)
-  .map((w) => w.toLowerCase())
+  .map(() => undefined)
 const uniqueWords = _.uniq(wordsArray)
 console.log(uniqueWords.length)

[NoCoverage] StringLiteral
src/assets/words.js:13:18
 const uniqueWords = _.uniq(wordsArray)
 console.log(uniqueWords.length)
 
-fs.writeFileSync('./words.txt', JSON.stringify(uniqueWords))
+fs.writeFileSync("", JSON.stringify(uniqueWords))
 
