[Killed] BooleanLiteral
src/components/GuessInput.vue:11:60
 }>()
 
 const letters = ref(props.availableLetters)
-const allClicked = ref([false, false, false, false, false, false])
+const allClicked = ref([false, false, false, false, false, true])
 
 const lettersClicked = computed(() =>
killedBy: GuessInput should match snapshot
statusReason: Snapshot `GuessInput > should match snapshot 1` mismatched

[Killed] BooleanLiteral
src/components/GuessInput.vue:11:46
 }>()
 
 const letters = ref(props.availableLetters)
-const allClicked = ref([false, false, false, false, false, false])
+const allClicked = ref([false, false, false, true, false, false])
 
 const lettersClicked = computed(() =>
killedBy: GuessInput should match snapshot
statusReason: Snapshot `GuessInput > should match snapshot 1` mismatched

[Killed] ArrowFunction
src/components/GuessInput.vue:13:33
 const letters = ref(props.availableLetters)
 const allClicked = ref([false, false, false, false, false, false])
 
-const lettersClicked = computed(() =>
-  allClicked.value.map((clicked, index) => ({ letter: letters.value[index], clicked, index }))
+const lettersClicked = computed(() => undefined
 )
 
killedBy: GuessInput should match snapshot
statusReason: Snapshot `GuessInput > should match snapshot 1` mismatched

[Killed] ArrowFunction
src/components/GuessInput.vue:14:24
 const allClicked = ref([false, false, false, false, false, false])
 
 const lettersClicked = computed(() =>
-  allClicked.value.map((clicked, index) => ({ letter: letters.value[index], clicked, index }))
+  allClicked.value.map(() => undefined)
 )
 
killedBy: GuessInput should match snapshot
statusReason: Cannot destructure property 'letter' of 'undefined' as it is undefined.

[Killed] ObjectLiteral
src/components/GuessInput.vue:17:29
   allClicked.value.map((clicked, index) => ({ letter: letters.value[index], clicked, index }))
 )
 
-const inputValue = computed({
-  get: () => {
-    return props.modelValue
-  },
-  set: (newValue) => {
-    emits('update:modelValue', newValue)
-  }
-})
+const inputValue = computed({})
 
 const onKeydown = (e: KeyboardEvent) => {
killedBy: GuessInput should match snapshot
statusReason: this.fn is not a function

[Survived] BlockStatement
src/components/GuessInput.vue:18:14
 )
 
 const inputValue = computed({
-  get: () => {
-    return props.modelValue
-  },
+  get: () => {},
   set: (newValue) => {
     emits('update:modelValue', newValue)

[NoCoverage] BlockStatement
src/components/GuessInput.vue:21:22
   get: () => {
     return props.modelValue
   },
-  set: (newValue) => {
-    emits('update:modelValue', newValue)
-  }
+  set: (newValue) => {}
 })
 

[NoCoverage] StringLiteral
src/components/GuessInput.vue:22:11
     return props.modelValue
   },
   set: (newValue) => {
-    emits('update:modelValue', newValue)
+    emits("", newValue)
   }
 })

[NoCoverage] BlockStatement
src/components/GuessInput.vue:26:41
   }
 })
 
-const onKeydown = (e: KeyboardEvent) => {
-  if (e.key === 'Enter') {
-    onEnter()
-  } else if (e.key === 'Alt' || e.key === 'Control' || e.key === 'Shift') {
-    shuffle()
-  } else if (e.key === 'Backspace') {
-    const indexLetter = letters.value.indexOf(inputValue.value.slice(-1))
-    allClicked.value[indexLetter] = false
-    inputValue.value = inputValue.value.slice(0, -1)
-
-    return
-  } else {
-    // const letter = e.key.toLowerCase()
-    const availableLetter = lettersClicked.value.find(
-      (l) => l.letter === e.key && l.clicked === false
-    )
-    if (availableLetter) {
-      inputValue.value += availableLetter.letter
-      allClicked.value[availableLetter.index] = true
-    }
-  }
-}
+const onKeydown = (e: KeyboardEvent) => {}
 
 const clickLetter = (letter: string, index: number, clicked: boolean) => {

[NoCoverage] ConditionalExpression
src/components/GuessInput.vue:27:7
 })
 
 const onKeydown = (e: KeyboardEvent) => {
-  if (e.key === 'Enter') {
+  if (true) {
     onEnter()
   } else if (e.key === 'Alt' || e.key === 'Control' || e.key === 'Shift') {

[NoCoverage] BlockStatement
src/components/GuessInput.vue:27:26
 })
 
 const onKeydown = (e: KeyboardEvent) => {
-  if (e.key === 'Enter') {
-    onEnter()
-  } else if (e.key === 'Alt' || e.key === 'Control' || e.key === 'Shift') {
+  if (e.key === 'Enter') {} else if (e.key === 'Alt' || e.key === 'Control' || e.key === 'Shift') {
     shuffle()
   } else if (e.key === 'Backspace') {

[NoCoverage] BlockStatement
src/components/GuessInput.vue:29:75
 const onKeydown = (e: KeyboardEvent) => {
   if (e.key === 'Enter') {
     onEnter()
-  } else if (e.key === 'Alt' || e.key === 'Control' || e.key === 'Shift') {
-    shuffle()
-  } else if (e.key === 'Backspace') {
+  } else if (e.key === 'Alt' || e.key === 'Control' || e.key === 'Shift') {} else if (e.key === 'Backspace') {
     const indexLetter = letters.value.indexOf(inputValue.value.slice(-1))
     allClicked.value[indexLetter] = false

[NoCoverage] EqualityOperator
src/components/GuessInput.vue:29:33
 const onKeydown = (e: KeyboardEvent) => {
   if (e.key === 'Enter') {
     onEnter()
-  } else if (e.key === 'Alt' || e.key === 'Control' || e.key === 'Shift') {
+  } else if (e.key === 'Alt' || e.key !== 'Control' || e.key === 'Shift') {
     shuffle()
   } else if (e.key === 'Backspace') {

[NoCoverage] BlockStatement
src/components/GuessInput.vue:31:37
     onEnter()
   } else if (e.key === 'Alt' || e.key === 'Control' || e.key === 'Shift') {
     shuffle()
-  } else if (e.key === 'Backspace') {
-    const indexLetter = letters.value.indexOf(inputValue.value.slice(-1))
-    allClicked.value[indexLetter] = false
-    inputValue.value = inputValue.value.slice(0, -1)
-
-    return
-  } else {
+  } else if (e.key === 'Backspace') {} else {
     // const letter = e.key.toLowerCase()
     const availableLetter = lettersClicked.value.find(

[NoCoverage] ConditionalExpression
src/components/GuessInput.vue:31:14
     onEnter()
   } else if (e.key === 'Alt' || e.key === 'Control' || e.key === 'Shift') {
     shuffle()
-  } else if (e.key === 'Backspace') {
+  } else if (false) {
     const indexLetter = letters.value.indexOf(inputValue.value.slice(-1))
     allClicked.value[indexLetter] = false

[NoCoverage] UnaryOperator
src/components/GuessInput.vue:32:70
   } else if (e.key === 'Alt' || e.key === 'Control' || e.key === 'Shift') {
     shuffle()
   } else if (e.key === 'Backspace') {
-    const indexLetter = letters.value.indexOf(inputValue.value.slice(-1))
+    const indexLetter = letters.value.indexOf(inputValue.value.slice(+1))
     allClicked.value[indexLetter] = false
     inputValue.value = inputValue.value.slice(0, -1)

[NoCoverage] MethodExpression
src/components/GuessInput.vue:32:47
   } else if (e.key === 'Alt' || e.key === 'Control' || e.key === 'Shift') {
     shuffle()
   } else if (e.key === 'Backspace') {
-    const indexLetter = letters.value.indexOf(inputValue.value.slice(-1))
+    const indexLetter = letters.value.indexOf(inputValue.value)
     allClicked.value[indexLetter] = false
     inputValue.value = inputValue.value.slice(0, -1)

[NoCoverage] BooleanLiteral
src/components/GuessInput.vue:33:37
     shuffle()
   } else if (e.key === 'Backspace') {
     const indexLetter = letters.value.indexOf(inputValue.value.slice(-1))
-    allClicked.value[indexLetter] = false
+    allClicked.value[indexLetter] = true
     inputValue.value = inputValue.value.slice(0, -1)
 

[NoCoverage] MethodExpression
src/components/GuessInput.vue:34:24
   } else if (e.key === 'Backspace') {
     const indexLetter = letters.value.indexOf(inputValue.value.slice(-1))
     allClicked.value[indexLetter] = false
-    inputValue.value = inputValue.value.slice(0, -1)
+    inputValue.value = inputValue.value
 
     return

[NoCoverage] UnaryOperator
src/components/GuessInput.vue:34:50
   } else if (e.key === 'Backspace') {
     const indexLetter = letters.value.indexOf(inputValue.value.slice(-1))
     allClicked.value[indexLetter] = false
-    inputValue.value = inputValue.value.slice(0, -1)
+    inputValue.value = inputValue.value.slice(0, +1)
 
     return

[NoCoverage] BlockStatement
src/components/GuessInput.vue:37:10
     inputValue.value = inputValue.value.slice(0, -1)
 
     return
-  } else {
-    // const letter = e.key.toLowerCase()
-    const availableLetter = lettersClicked.value.find(
-      (l) => l.letter === e.key && l.clicked === false
-    )
-    if (availableLetter) {
-      inputValue.value += availableLetter.letter
-      allClicked.value[availableLetter.index] = true
-    }
-  }
+  } else {}
 }
 

[NoCoverage] ConditionalExpression
src/components/GuessInput.vue:40:14
   } else {
     // const letter = e.key.toLowerCase()
     const availableLetter = lettersClicked.value.find(
-      (l) => l.letter === e.key && l.clicked === false
+      (l) => true
     )
     if (availableLetter) {

[NoCoverage] ConditionalExpression
src/components/GuessInput.vue:40:14
   } else {
     // const letter = e.key.toLowerCase()
     const availableLetter = lettersClicked.value.find(
-      (l) => l.letter === e.key && l.clicked === false
+      (l) => true && l.clicked === false
     )
     if (availableLetter) {

[NoCoverage] ConditionalExpression
src/components/GuessInput.vue:42:9
     const availableLetter = lettersClicked.value.find(
       (l) => l.letter === e.key && l.clicked === false
     )
-    if (availableLetter) {
+    if (false) {
       inputValue.value += availableLetter.letter
       allClicked.value[availableLetter.index] = true

[NoCoverage] ConditionalExpression
src/components/GuessInput.vue:42:9
     const availableLetter = lettersClicked.value.find(
       (l) => l.letter === e.key && l.clicked === false
     )
-    if (availableLetter) {
+    if (true) {
       inputValue.value += availableLetter.letter
       allClicked.value[availableLetter.index] = true

[NoCoverage] AssignmentOperator
src/components/GuessInput.vue:43:7
       (l) => l.letter === e.key && l.clicked === false
     )
     if (availableLetter) {
-      inputValue.value += availableLetter.letter
+      inputValue.value -= availableLetter.letter
       allClicked.value[availableLetter.index] = true
     }

[NoCoverage] BooleanLiteral
src/components/GuessInput.vue:44:49
     )
     if (availableLetter) {
       inputValue.value += availableLetter.letter
-      allClicked.value[availableLetter.index] = true
+      allClicked.value[availableLetter.index] = false
     }
   }

[NoCoverage] BlockStatement
src/components/GuessInput.vue:49:74
   }
 }
 
-const clickLetter = (letter: string, index: number, clicked: boolean) => {
-  if (clicked) {
-    inputValue.value = inputValue.value.slice(0, -1)
-    allClicked.value[index] = false
-  } else {
-    inputValue.value = inputValue.value.concat(letter)
-    allClicked.value[index] = true
-  }
-}
+const clickLetter = (letter: string, index: number, clicked: boolean) => {}
 
 const onEnter = () => {

[NoCoverage] ConditionalExpression
src/components/GuessInput.vue:50:7
 }
 
 const clickLetter = (letter: string, index: number, clicked: boolean) => {
-  if (clicked) {
+  if (false) {
     inputValue.value = inputValue.value.slice(0, -1)
     allClicked.value[index] = false

[NoCoverage] ConditionalExpression
src/components/GuessInput.vue:50:7
 }
 
 const clickLetter = (letter: string, index: number, clicked: boolean) => {
-  if (clicked) {
+  if (true) {
     inputValue.value = inputValue.value.slice(0, -1)
     allClicked.value[index] = false

[NoCoverage] MethodExpression
src/components/GuessInput.vue:51:24
 
 const clickLetter = (letter: string, index: number, clicked: boolean) => {
   if (clicked) {
-    inputValue.value = inputValue.value.slice(0, -1)
+    inputValue.value = inputValue.value
     allClicked.value[index] = false
   } else {

[NoCoverage] UnaryOperator
src/components/GuessInput.vue:51:50
 
 const clickLetter = (letter: string, index: number, clicked: boolean) => {
   if (clicked) {
-    inputValue.value = inputValue.value.slice(0, -1)
+    inputValue.value = inputValue.value.slice(0, +1)
     allClicked.value[index] = false
   } else {

[NoCoverage] BooleanLiteral
src/components/GuessInput.vue:52:31
 const clickLetter = (letter: string, index: number, clicked: boolean) => {
   if (clicked) {
     inputValue.value = inputValue.value.slice(0, -1)
-    allClicked.value[index] = false
+    allClicked.value[index] = true
   } else {
     inputValue.value = inputValue.value.concat(letter)

[NoCoverage] BlockStatement
src/components/GuessInput.vue:53:10
   if (clicked) {
     inputValue.value = inputValue.value.slice(0, -1)
     allClicked.value[index] = false
-  } else {
-    inputValue.value = inputValue.value.concat(letter)
-    allClicked.value[index] = true
-  }
+  } else {}
 }
 

[NoCoverage] BooleanLiteral
src/components/GuessInput.vue:55:31
     allClicked.value[index] = false
   } else {
     inputValue.value = inputValue.value.concat(letter)
-    allClicked.value[index] = true
+    allClicked.value[index] = false
   }
 }

[NoCoverage] BlockStatement
src/components/GuessInput.vue:59:23
   }
 }
 
-const onEnter = () => {
-  emits('enter')
-  allClicked.value = [false, false, false, false, false, false]
-}
+const onEnter = () => {}
 
 const shuffle = () => {

[NoCoverage] BooleanLiteral
src/components/GuessInput.vue:61:23
 
 const onEnter = () => {
   emits('enter')
-  allClicked.value = [false, false, false, false, false, false]
+  allClicked.value = [true, false, false, false, false, false]
 }
 

[NoCoverage] BooleanLiteral
src/components/GuessInput.vue:61:44
 
 const onEnter = () => {
   emits('enter')
-  allClicked.value = [false, false, false, false, false, false]
+  allClicked.value = [false, false, false, true, false, false]
 }
 

[NoCoverage] BlockStatement
src/components/GuessInput.vue:64:23
   allClicked.value = [false, false, false, false, false, false]
 }
 
-const shuffle = () => {
-  letters.value = letters.value.sort(() => 0.5 - Math.random())
-  inputValue.value = ''
-  allClicked.value = [false, false, false, false, false, false]
-}
+const shuffle = () => {}
 
 const onDelete = () => {

[NoCoverage] MethodExpression
src/components/GuessInput.vue:65:19
 }
 
 const shuffle = () => {
-  letters.value = letters.value.sort(() => 0.5 - Math.random())
+  letters.value = letters.value
   inputValue.value = ''
   allClicked.value = [false, false, false, false, false, false]

[NoCoverage] ArrowFunction
src/components/GuessInput.vue:65:38
 }
 
 const shuffle = () => {
-  letters.value = letters.value.sort(() => 0.5 - Math.random())
+  letters.value = letters.value.sort(() => undefined)
   inputValue.value = ''
   allClicked.value = [false, false, false, false, false, false]

[NoCoverage] BooleanLiteral
src/components/GuessInput.vue:67:51
 const shuffle = () => {
   letters.value = letters.value.sort(() => 0.5 - Math.random())
   inputValue.value = ''
-  allClicked.value = [false, false, false, false, false, false]
+  allClicked.value = [false, false, false, false, true, false]
 }
 

[NoCoverage] BooleanLiteral
src/components/GuessInput.vue:67:30
 const shuffle = () => {
   letters.value = letters.value.sort(() => 0.5 - Math.random())
   inputValue.value = ''
-  allClicked.value = [false, false, false, false, false, false]
+  allClicked.value = [false, true, false, false, false, false]
 }
 

[NoCoverage] BlockStatement
src/components/GuessInput.vue:70:24
   allClicked.value = [false, false, false, false, false, false]
 }
 
-const onDelete = () => {
-  const availableLetter = lettersClicked.value.find(
-    (l) => l.letter === inputValue.value.slice(-1) && l.clicked === true
-  )
-  if (availableLetter) {
-    inputValue.value = inputValue.value.slice(0, -1)
-    allClicked.value[availableLetter?.index] = false
-  }
-}
+const onDelete = () => {}
 </script>
 

[NoCoverage] ArrowFunction
src/components/GuessInput.vue:72:5
 
 const onDelete = () => {
   const availableLetter = lettersClicked.value.find(
-    (l) => l.letter === inputValue.value.slice(-1) && l.clicked === true
+    () => undefined
   )
   if (availableLetter) {

[NoCoverage] ConditionalExpression
src/components/GuessInput.vue:72:12
 
 const onDelete = () => {
   const availableLetter = lettersClicked.value.find(
-    (l) => l.letter === inputValue.value.slice(-1) && l.clicked === true
+    (l) => true
   )
   if (availableLetter) {

[NoCoverage] BlockStatement
src/components/GuessInput.vue:74:24
   const availableLetter = lettersClicked.value.find(
     (l) => l.letter === inputValue.value.slice(-1) && l.clicked === true
   )
-  if (availableLetter) {
-    inputValue.value = inputValue.value.slice(0, -1)
-    allClicked.value[availableLetter?.index] = false
-  }
+  if (availableLetter) {}
 }
 </script>

[NoCoverage] UnaryOperator
src/components/GuessInput.vue:75:50
     (l) => l.letter === inputValue.value.slice(-1) && l.clicked === true
   )
   if (availableLetter) {
-    inputValue.value = inputValue.value.slice(0, -1)
+    inputValue.value = inputValue.value.slice(0, +1)
     allClicked.value[availableLetter?.index] = false
   }

[NoCoverage] MethodExpression
src/components/GuessInput.vue:75:24
     (l) => l.letter === inputValue.value.slice(-1) && l.clicked === true
   )
   if (availableLetter) {
-    inputValue.value = inputValue.value.slice(0, -1)
+    inputValue.value = inputValue.value
     allClicked.value[availableLetter?.index] = false
   }

[NoCoverage] OptionalChaining
src/components/GuessInput.vue:76:22
   )
   if (availableLetter) {
     inputValue.value = inputValue.value.slice(0, -1)
-    allClicked.value[availableLetter?.index] = false
+    allClicked.value[availableLetter.index] = false
   }
 }

[NoCoverage] BooleanLiteral
src/components/GuessInput.vue:76:48
   )
   if (availableLetter) {
     inputValue.value = inputValue.value.slice(0, -1)
-    allClicked.value[availableLetter?.index] = false
+    allClicked.value[availableLetter?.index] = true
   }
 }
