[NoCoverage] StringLiteral
src/main.ts:16:41
 
 app.mount('#app')
 
-const localScore = localStorage.getItem('high-score')
+const localScore = localStorage.getItem("")
 if (!localScore) {
   localStorage.setItem('high-score', '0')

[NoCoverage] BlockStatement
src/main.ts:17:18
 app.mount('#app')
 
 const localScore = localStorage.getItem('high-score')
-if (!localScore) {
-  localStorage.setItem('high-score', '0')
-}
+if (!localScore) {}
 

[NoCoverage] ConditionalExpression
src/main.ts:17:5
 app.mount('#app')
 
 const localScore = localStorage.getItem('high-score')
-if (!localScore) {
+if (true) {
   localStorage.setItem('high-score', '0')
 }
