[Killed] StringLiteral
src/views/GameView.vue:10:26
 
 const { allWords, availableLetters } = useWords()
 const { score, findWord, highScore } = useScore()
-const currentGuess = ref('')
+const currentGuess = ref("Stryker was here!")
 const wordGuesses = ref(allWords.map((word) => ({ value: word, visible: false, found: false })))
 
killedBy: GameView should mount
statusReason: Snapshot `GameView > should mount 1` mismatched

[Survived] ArrowFunction
src/views/GameView.vue:11:38
 const { allWords, availableLetters } = useWords()
 const { score, findWord, highScore } = useScore()
 const currentGuess = ref('')
-const wordGuesses = ref(allWords.map((word) => ({ value: word, visible: false, found: false })))
+const wordGuesses = ref(allWords.map(() => undefined))
 
 const makeGuess = () => {

[NoCoverage] BooleanLiteral
src/views/GameView.vue:11:87
 const { allWords, availableLetters } = useWords()
 const { score, findWord, highScore } = useScore()
 const currentGuess = ref('')
-const wordGuesses = ref(allWords.map((word) => ({ value: word, visible: false, found: false })))
+const wordGuesses = ref(allWords.map((word) => ({ value: word, visible: false, found: true })))
 
 const makeGuess = () => {

[NoCoverage] BlockStatement
src/views/GameView.vue:13:25
 const currentGuess = ref('')
 const wordGuesses = ref(allWords.map((word) => ({ value: word, visible: false, found: false })))
 
-const makeGuess = () => {
-  const word = wordGuesses.value.find((g) => g.value === currentGuess.value)
-  if (word) {
-    word.found = true
-    word.visible = true
-    findWord(word.value.length)
-  }
-  currentGuess.value = ''
-}
+const makeGuess = () => {}
 
 const giveUp = () => {

[NoCoverage] EqualityOperator
src/views/GameView.vue:14:46
 const wordGuesses = ref(allWords.map((word) => ({ value: word, visible: false, found: false })))
 
 const makeGuess = () => {
-  const word = wordGuesses.value.find((g) => g.value === currentGuess.value)
+  const word = wordGuesses.value.find((g) => g.value !== currentGuess.value)
   if (word) {
     word.found = true

[NoCoverage] ConditionalExpression
src/views/GameView.vue:14:46
 const wordGuesses = ref(allWords.map((word) => ({ value: word, visible: false, found: false })))
 
 const makeGuess = () => {
-  const word = wordGuesses.value.find((g) => g.value === currentGuess.value)
+  const word = wordGuesses.value.find((g) => true)
   if (word) {
     word.found = true

[NoCoverage] ConditionalExpression
src/views/GameView.vue:15:7
 
 const makeGuess = () => {
   const word = wordGuesses.value.find((g) => g.value === currentGuess.value)
-  if (word) {
+  if (true) {
     word.found = true
     word.visible = true

[NoCoverage] ConditionalExpression
src/views/GameView.vue:15:7
 
 const makeGuess = () => {
   const word = wordGuesses.value.find((g) => g.value === currentGuess.value)
-  if (word) {
+  if (false) {
     word.found = true
     word.visible = true

[NoCoverage] BooleanLiteral
src/views/GameView.vue:16:18
 const makeGuess = () => {
   const word = wordGuesses.value.find((g) => g.value === currentGuess.value)
   if (word) {
-    word.found = true
+    word.found = false
     word.visible = true
     findWord(word.value.length)

[NoCoverage] BooleanLiteral
src/views/GameView.vue:17:20
   const word = wordGuesses.value.find((g) => g.value === currentGuess.value)
   if (word) {
     word.found = true
-    word.visible = true
+    word.visible = false
     findWord(word.value.length)
   }

[NoCoverage] BlockStatement
src/views/GameView.vue:23:22
   currentGuess.value = ''
 }
 
-const giveUp = () => {
-  wordGuesses.value.forEach((g) => {
-    g.visible = true
-  })
-}
+const giveUp = () => {}
 
 const newGame = () => {

[NoCoverage] BlockStatement
src/views/GameView.vue:24:36
 }
 
 const giveUp = () => {
-  wordGuesses.value.forEach((g) => {
-    g.visible = true
-  })
+  wordGuesses.value.forEach((g) => {})
 }
 

[NoCoverage] BooleanLiteral
src/views/GameView.vue:25:17
 
 const giveUp = () => {
   wordGuesses.value.forEach((g) => {
-    g.visible = true
+    g.visible = false
   })
 }

[NoCoverage] BlockStatement
src/views/GameView.vue:29:23
   })
 }
 
-const newGame = () => {
-  window.location.reload()
-}
+const newGame = () => {}
 </script>
 
