[Killed] BlockStatement
src/services/useScore.ts:4:24
 import { computed } from 'vue'
 import useScoreStore from '@/stores/score'
 
-const useScore = () => {
-  const scoreStore = useScoreStore()
-
-  return {
-    highScore: computed(() => scoreStore.highScore),
-    score: computed(() => scoreStore.score),
-    findWord: scoreStore.findWord
-  }
-}
+const useScore = () => {}
 
 export default useScore
killedBy: GameView should mount
statusReason: Cannot destructure property 'score' of 'default(...)' as it is undefined.

[Killed] ObjectLiteral
src/services/useScore.ts:7:10
 const useScore = () => {
   const scoreStore = useScoreStore()
 
-  return {
-    highScore: computed(() => scoreStore.highScore),
-    score: computed(() => scoreStore.score),
-    findWord: scoreStore.findWord
-  }
+  return {}
 }
 
killedBy: GameView should mount
statusReason: Snapshot `GameView > should mount 1` mismatched

[Killed] ArrowFunction
src/services/useScore.ts:8:25
   const scoreStore = useScoreStore()
 
   return {
-    highScore: computed(() => scoreStore.highScore),
+    highScore: computed(() => undefined),
     score: computed(() => scoreStore.score),
     findWord: scoreStore.findWord
killedBy: GameView should mount
statusReason: Snapshot `GameView > should mount 1` mismatched

[Killed] ArrowFunction
src/services/useScore.ts:9:21
 
   return {
     highScore: computed(() => scoreStore.highScore),
-    score: computed(() => scoreStore.score),
+    score: computed(() => undefined),
     findWord: scoreStore.findWord
   }
killedBy: GameView should mount
statusReason: Snapshot `GameView > should mount 1` mismatched
