[Killed] BlockStatement
src/services/useWords.ts:3:24
 import { useWordsStore } from '@/stores/words'
 
-const useWords = () => {
-  const { allWords, chooseWord, availableLetters } = useWordsStore()
-  return { chooseWord, allWords, availableLetters }
-}
+const useWords = () => {}
 
 export default useWords
killedBy: GameView should mount
statusReason: Cannot destructure property 'allWords' of 'default(...)' as it is undefined.
