[Killed] BlockStatement
src/stores/score.ts:4:50
 import { ref } from 'vue'
 import { defineStore } from 'pinia'
 
-const useScoreStore = defineStore('score', () => {
-  const score = ref(0)
-  const highScore = ref(parseInt(localStorage.getItem('high-score') ?? '0'))
-
-  const findWord = (wordLength: number) => {
-    score.value += wordLength
-
-    if (score.value > highScore.value) {
-      localStorage.setItem('high-score', score.value.toString())
-      highScore.value = score.value
-    }
-  }
-
-  const resetScore = () => {
-    score.value = 0
-  }
-
-  return { score, findWord, resetScore, highScore }
-})
+const useScoreStore = defineStore('score', () => {})
 export default useScoreStore
 
killedBy: GameView should mount
statusReason: Snapshot `GameView > should mount 1` mismatched

[Survived] StringLiteral
src/stores/score.ts:4:35
 import { ref } from 'vue'
 import { defineStore } from 'pinia'
 
-const useScoreStore = defineStore('score', () => {
+const useScoreStore = defineStore("", () => {
   const score = ref(0)
   const highScore = ref(parseInt(localStorage.getItem('high-score') ?? '0'))

[Killed] LogicalOperator
src/stores/score.ts:6:34
 
 const useScoreStore = defineStore('score', () => {
   const score = ref(0)
-  const highScore = ref(parseInt(localStorage.getItem('high-score') ?? '0'))
+  const highScore = ref(parseInt(localStorage.getItem('high-score') && '0'))
 
   const findWord = (wordLength: number) => {
killedBy: GameView should mount
statusReason: Snapshot `GameView > should mount 1` mismatched

[Killed] BlockStatement
src/stores/score.ts:8:44
   const score = ref(0)
   const highScore = ref(parseInt(localStorage.getItem('high-score') ?? '0'))
 
-  const findWord = (wordLength: number) => {
-    score.value += wordLength
-
-    if (score.value > highScore.value) {
-      localStorage.setItem('high-score', score.value.toString())
-      highScore.value = score.value
-    }
-  }
+  const findWord = (wordLength: number) => {}
 
   const resetScore = () => {
killedBy: score store should update high score if new score is higher
statusReason: expected +0 to be 18 // Object.is equality

[Killed] AssignmentOperator
src/stores/score.ts:9:5
   const highScore = ref(parseInt(localStorage.getItem('high-score') ?? '0'))
 
   const findWord = (wordLength: number) => {
-    score.value += wordLength
+    score.value -= wordLength
 
     if (score.value > highScore.value) {
killedBy: score store should update high score if new score is higher
statusReason: expected -18 to be 18 // Object.is equality

[Killed] ConditionalExpression
src/stores/score.ts:11:9
   const findWord = (wordLength: number) => {
     score.value += wordLength
 
-    if (score.value > highScore.value) {
+    if (false) {
       localStorage.setItem('high-score', score.value.toString())
       highScore.value = score.value
killedBy: score store should update high score if new score is higher
statusReason: expected 12 to be 18 // Object.is equality

[Killed] BlockStatement
src/stores/score.ts:11:40
   const findWord = (wordLength: number) => {
     score.value += wordLength
 
-    if (score.value > highScore.value) {
-      localStorage.setItem('high-score', score.value.toString())
-      highScore.value = score.value
-    }
+    if (score.value > highScore.value) {}
   }
 
killedBy: score store should update high score if new score is higher
statusReason: expected 12 to be 18 // Object.is equality

[Killed] BlockStatement
src/stores/score.ts:17:28
     }
   }
 
-  const resetScore = () => {
-    score.value = 0
-  }
+  const resetScore = () => {}
 
   return { score, findWord, resetScore, highScore }
killedBy: score store should be able to reset score
statusReason: expected 12 to be +0 // Object.is equality

[Killed] ObjectLiteral
src/stores/score.ts:21:10
     score.value = 0
   }
 
-  return { score, findWord, resetScore, highScore }
+  return {}
 })
 export default useScoreStore
killedBy: score store should init at 0
statusReason: expected undefined to be +0 // Object.is equality
