[Killed] EqualityOperator
src/stores/words.ts:6:76
 // import words from 'an-array-of-french-words'
 import relevantWords from '@/assets/words.json'
 
-export const allSixLetterWords = (relevantWords as string[]).filter((w) => w.length === 6)
+export const allSixLetterWords = (relevantWords as string[]).filter((w) => w.length !== 6)
 export const findAllOtherWords = (relevantWords: string[], mainWord: string) => {
   const allWords = relevantWords.filter((word) => {
killedBy: words store util functions should find all 6 letter words
statusReason: expected [ 'mat', 'mot', 'autre' ] to deeply equal [ 'tomate' ]

[Killed] MethodExpression
src/stores/words.ts:6:34
 // import words from 'an-array-of-french-words'
 import relevantWords from '@/assets/words.json'
 
-export const allSixLetterWords = (relevantWords as string[]).filter((w) => w.length === 6)
+export const allSixLetterWords = relevantWords as string[]
 export const findAllOtherWords = (relevantWords: string[], mainWord: string) => {
   const allWords = relevantWords.filter((word) => {
killedBy: words store util functions should find all 6 letter words
statusReason: expected [ 'tomate', 'mat', 'mot', 'autre' ] to deeply equal [ 'tomate' ]

[Killed] BlockStatement
src/stores/words.ts:7:81
 import relevantWords from '@/assets/words.json'
 
 export const allSixLetterWords = (relevantWords as string[]).filter((w) => w.length === 6)
-export const findAllOtherWords = (relevantWords: string[], mainWord: string) => {
-  const allWords = relevantWords.filter((word) => {
-    const tempWord = ref(mainWord)
-    return word
-      .split('')
-      .map((letter) => {
-        const includesLetter = tempWord.value.includes(letter)
-        if (includesLetter) {
-          tempWord.value = tempWord.value.replace(letter, '')
-        }
-        return includesLetter
-      })
-      .reduce((acc, val) => acc && val, true)
-  })
-
-  return allWords.sort((a: string, b: string) => (a.length < b.length ? -1 : 1))
-}
+export const findAllOtherWords = (relevantWords: string[], mainWord: string) => {}
 export const useWordsStore = defineStore('words', () => {
   const mainWord = ref('')
killedBy: words store util functions should find all corresponding words from a 6 letter word
statusReason: expected undefined to deeply equal [ 'mat', 'mot', 'tomate' ]

[Killed] MethodExpression
src/stores/words.ts:8:20
 
 export const allSixLetterWords = (relevantWords as string[]).filter((w) => w.length === 6)
 export const findAllOtherWords = (relevantWords: string[], mainWord: string) => {
-  const allWords = relevantWords.filter((word) => {
-    const tempWord = ref(mainWord)
-    return word
-      .split('')
-      .map((letter) => {
-        const includesLetter = tempWord.value.includes(letter)
-        if (includesLetter) {
-          tempWord.value = tempWord.value.replace(letter, '')
-        }
-        return includesLetter
-      })
-      .reduce((acc, val) => acc && val, true)
-  })
+  const allWords = relevantWords
 
   return allWords.sort((a: string, b: string) => (a.length < b.length ? -1 : 1))
killedBy: words store util functions should find all corresponding words from a 6 letter word
statusReason: expected [ 'mat', 'mot', 'autre', …(2) ] to deeply equal [ 'mat', 'mot', 'tomate' ]

[Killed] BlockStatement
src/stores/words.ts:8:51
 
 export const allSixLetterWords = (relevantWords as string[]).filter((w) => w.length === 6)
 export const findAllOtherWords = (relevantWords: string[], mainWord: string) => {
-  const allWords = relevantWords.filter((word) => {
-    const tempWord = ref(mainWord)
-    return word
-      .split('')
-      .map((letter) => {
-        const includesLetter = tempWord.value.includes(letter)
-        if (includesLetter) {
-          tempWord.value = tempWord.value.replace(letter, '')
-        }
-        return includesLetter
-      })
-      .reduce((acc, val) => acc && val, true)
-  })
+  const allWords = relevantWords.filter((word) => {})
 
   return allWords.sort((a: string, b: string) => (a.length < b.length ? -1 : 1))
killedBy: words store util functions should find all corresponding words from a 6 letter word
statusReason: expected [] to deeply equal [ 'mat', 'mot', 'tomate' ]

[Killed] BlockStatement
src/stores/words.ts:12:24
     const tempWord = ref(mainWord)
     return word
       .split('')
-      .map((letter) => {
-        const includesLetter = tempWord.value.includes(letter)
-        if (includesLetter) {
-          tempWord.value = tempWord.value.replace(letter, '')
-        }
-        return includesLetter
-      })
+      .map((letter) => {})
       .reduce((acc, val) => acc && val, true)
   })
killedBy: words store util functions should find all corresponding words from a 6 letter word
statusReason: expected [] to deeply equal [ 'mat', 'mot', 'tomate' ]

[Survived] ConditionalExpression
src/stores/words.ts:14:13
       .split('')
       .map((letter) => {
         const includesLetter = tempWord.value.includes(letter)
-        if (includesLetter) {
+        if (false) {
           tempWord.value = tempWord.value.replace(letter, '')
         }

[Survived] BlockStatement
src/stores/words.ts:14:29
       .split('')
       .map((letter) => {
         const includesLetter = tempWord.value.includes(letter)
-        if (includesLetter) {
-          tempWord.value = tempWord.value.replace(letter, '')
-        }
+        if (includesLetter) {}
         return includesLetter
       })

[Killed] ConditionalExpression
src/stores/words.ts:19:29
         }
         return includesLetter
       })
-      .reduce((acc, val) => acc && val, true)
+      .reduce((acc, val) => false, true)
   })
 
killedBy: words store util functions should find all corresponding words from a 6 letter word
statusReason: expected [] to deeply equal [ 'mat', 'mot', 'tomate' ]

[Killed] ConditionalExpression
src/stores/words.ts:19:29
         }
         return includesLetter
       })
-      .reduce((acc, val) => acc && val, true)
+      .reduce((acc, val) => true, true)
   })
 
killedBy: words store util functions should find all corresponding words from a 6 letter word
statusReason: expected [ 'mat', 'mot', 'autre', …(2) ] to deeply equal [ 'mat', 'mot', 'tomate' ]

[Killed] ConditionalExpression
src/stores/words.ts:22:51
       .reduce((acc, val) => acc && val, true)
   })
 
-  return allWords.sort((a: string, b: string) => (a.length < b.length ? -1 : 1))
+  return allWords.sort((a: string, b: string) => (false ? -1 : 1))
 }
 export const useWordsStore = defineStore('words', () => {
killedBy: words store util functions should find all corresponding words from a 6 letter word
statusReason: expected [ 'tomate', 'mat', 'mot' ] to deeply equal [ 'mat', 'mot', 'tomate' ]

[Killed] ConditionalExpression
src/stores/words.ts:22:51
       .reduce((acc, val) => acc && val, true)
   })
 
-  return allWords.sort((a: string, b: string) => (a.length < b.length ? -1 : 1))
+  return allWords.sort((a: string, b: string) => (true ? -1 : 1))
 }
 export const useWordsStore = defineStore('words', () => {
killedBy: words store util functions should find all corresponding words from a 6 letter word
statusReason: expected [ 'mot', 'mat', 'tomate' ] to deeply equal [ 'mat', 'mot', 'tomate' ]

[Killed] BlockStatement
src/stores/words.ts:24:57
 
   return allWords.sort((a: string, b: string) => (a.length < b.length ? -1 : 1))
 }
-export const useWordsStore = defineStore('words', () => {
-  const mainWord = ref('')
-  const allOtherWords = ref<string[]>([])
-
-  const availableLetters = computed(() => mainWord.value.split('').sort(() => 0.5 - Math.random()))
-
-  const chooseWord = () => {
-    const i = Math.floor(Math.random() * allSixLetterWords.length)
-    mainWord.value = allSixLetterWords[i]
-    allOtherWords.value = findAllOtherWords(relevantWords, mainWord.value)
-  }
-
-  return { allWords: allOtherWords, chooseWord, availableLetters }
-})
+export const useWordsStore = defineStore('words', () => {})
 
killedBy: words store store should init correctly
statusReason: expected undefined to strictly equal []

[Survived] StringLiteral
src/stores/words.ts:24:42
 
   return allWords.sort((a: string, b: string) => (a.length < b.length ? -1 : 1))
 }
-export const useWordsStore = defineStore('words', () => {
+export const useWordsStore = defineStore("", () => {
   const mainWord = ref('')
   const allOtherWords = ref<string[]>([])

[Killed] StringLiteral
src/stores/words.ts:25:24
   return allWords.sort((a: string, b: string) => (a.length < b.length ? -1 : 1))
 }
 export const useWordsStore = defineStore('words', () => {
-  const mainWord = ref('')
+  const mainWord = ref("Stryker was here!")
   const allOtherWords = ref<string[]>([])
 
killedBy: words store store should be able to select a word
statusReason: expected [ 'y', 'e', ' ', 'k', '!', 't', …(11) ] to deeply equal []

[Killed] ArrowFunction
src/stores/words.ts:28:37
   const mainWord = ref('')
   const allOtherWords = ref<string[]>([])
 
-  const availableLetters = computed(() => mainWord.value.split('').sort(() => 0.5 - Math.random()))
+  const availableLetters = computed(() => undefined)
 
   const chooseWord = () => {
killedBy: words store store should be able to select a word
statusReason: expected undefined to deeply equal []

[Survived] ArithmeticOperator
src/stores/words.ts:28:79
   const mainWord = ref('')
   const allOtherWords = ref<string[]>([])
 
-  const availableLetters = computed(() => mainWord.value.split('').sort(() => 0.5 - Math.random()))
+  const availableLetters = computed(() => mainWord.value.split('').sort(() => 0.5 + Math.random()))
 
   const chooseWord = () => {

[Killed] BlockStatement
src/stores/words.ts:30:28
 
   const availableLetters = computed(() => mainWord.value.split('').sort(() => 0.5 - Math.random()))
 
-  const chooseWord = () => {
-    const i = Math.floor(Math.random() * allSixLetterWords.length)
-    mainWord.value = allSixLetterWords[i]
-    allOtherWords.value = findAllOtherWords(relevantWords, mainWord.value)
-  }
+  const chooseWord = () => {}
 
   return { allWords: allOtherWords, chooseWord, availableLetters }
killedBy: words store store should be able to select a word
statusReason: expected [] to include 't'

[Survived] ArithmeticOperator
src/stores/words.ts:31:26
   const availableLetters = computed(() => mainWord.value.split('').sort(() => 0.5 - Math.random()))
 
   const chooseWord = () => {
-    const i = Math.floor(Math.random() * allSixLetterWords.length)
+    const i = Math.floor(Math.random() / allSixLetterWords.length)
     mainWord.value = allSixLetterWords[i]
     allOtherWords.value = findAllOtherWords(relevantWords, mainWord.value)
